import React from 'react'
import Container from './Container'
import Heading from './Heading'

const About = () => {
  return (
    <>
    <Container>
        <div className=" flex justify-between">
            <div className="w-[36%]">
        <img
              src="https://glorebd.com/assets/about_img-4BbpaMTv.webp"
              alt="Banner"
              className=" h-[750px] w-[550px] rounded-2xl "
            />
    </div>
    <div className="w-[60%]">
     <Heading
              text={"Who We Are"}
              as={"p"}
              className={"text-[30px] hover:text-pink-600 text-center mt-[50px]"}
            />
     <Heading
              text={"GloreBD-এ আপনাকে স্বাগতম! আমরা বাংলাদেশের একটি গর্বিত ব্র্যান্ড। আমাদের যাত্রা শুরু হয়েছিল একটি স্বপ্ন নিয়ে—নারীদের জন্য এমন ফ্যাশন সরবরাহ করা যা মান, আভিজাত্য এবং আরামের প্রতিশ্রুতি দেয়। GloreBD সেই চাহিদা পূরণে প্রতিশ্রুতিবদ্ধ। আমাদের মূল লক্ষ্য হলো ফ্যাশন ও আরামকে একসাথে নিয়ে এসে এমন পোশাক তৈরি করা যা প্রতিটি নারীর ব্যক্তিত্ব ও সৌন্দর্যকে আরও উজ্জ্বল করে তোলে। আমাদের যাত্রায় অংশ নিন এবং নিজেকে সাজান অনন্যভাবে। আপনার ফ্যাশন, আপনার পরিচয় GloreBD এর সাথে।"}
              as={"p"}
              className={"text-[15px] hover:text-pink-600"}
            />
     <Heading
              text={"✨ GloreBD-এর সাথে ফ্যাশনে পা রাখুন নতুন দিগন্তে! ✨"}
              as={"p"}
              className={"text-[30px] hover:text-pink-600 text-center mt-[50px]"}
            />
     <Heading
              text={"আমাদের এক্সক্লুসিভ নতুন কালেকশন এখন উপলব্ধ! আপনার প্রিয় ফ্যাশন স্টাইল খুঁজে নিন আর নিজেকে সাজান অনন্যভাবে। ❤️ আমাদের তিন পিস কালেকশন সাজানো হয়েছে আধুনিক ট্রেন্ড ও ঐতিহ্যের মিশেলে। প্রতিটি পোশাক এমনভাবে ডিজাইন করা হয়েছে যাতে এটি শুধু সুন্দর দেখায় না, বরং আরামদায়কও হয়। আমরা আমাদের প্রতিটি প্রোডাক্টের মান ও ফিনিশিং নিশ্চিত করতে সর্বোচ্চ যত্ন নিয়ে কাজ করি। আমাদের ফ্যাব্রিক নির্বাচন থেকে শুরু করে সেলাই পর্যন্ত প্রতিটি ধাপ পেশাদার ও মনোযোগী। প্রতিদিনের ব্যবহারের জন্য সহজলভ্য ডিজাইন থেকে উৎসবের জন্য ঝলমলে ডিজাইন পর্যন্ত আমাদের কালেকশনে রয়েছে সবকিছু। আমাদের কালেকশন আপনাকে দেবে ফ্যাশনের আধুনিকতা এবং ঐতিহ্যের একটি নিখুঁত সংমিশ্রণ।"}
              as={"p"}
              className={"text-[15px] hover:text-pink-600"}
            />
     <Heading
              text={"✨ আপনার স্টাইল, আপনার পরিচয়! ✨"}
              as={"p"}
              className={"text-[30px] hover:text-pink-600 text-center mt-[50px]"}
            />
     <Heading
              text={"GloreBD-এ আপনি পাবেন এমন পোশাক যা আপনার আত্মবিশ্বাস বাড়াবে এবং আপনাকে নতুনভাবে তুলে ধরবে। আমরা জানি, আপনার স্টাইল শুধু আপনার সৌন্দর্যের প্রকাশ নয়, এটি আপনার আত্মবিশ্বাসেরও প্রতিফলন। আমাদের পেছনের দলটি গঠিত হয়েছে প্যাশনেট ডিজাইনার, দক্ষ ক্রাফটসম্যান এবং নিবেদিত ব্যবস্থাপকদের দ্বারা, যারা প্রতিটি পোশাককে নিখুঁতভাবে তৈরি করতে কঠোর পরিশ্রম করেন। আমাদের দল নারীদের চাহিদা বুঝতে সক্ষম এবং সেই অনুযায়ী নতুন ডিজাইন নিয়ে আসতে সর্বদা আগ্রহী। আমাদের প্রোডাক্ট ও সার্ভিস নিয়ে আরও জানতে, অথবা আমাদের সাথে আপনার মতামত ভাগ করে নিতে, আপনি যেকোনো সময় আমাদের সাথে যোগাযোগ করতে পারেন।"}
              as={"p"}
              className={"text-[15px] hover:text-pink-600"}
            />
    </div>
        </div>
    </Container>
    </>
  )
}

export default About